#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_role.eks_worker: Refreshing state... [id=EKSWorkerPolicy]
aws_vpc.application_vpc: Refreshing state... [id=vpc-06f3da5b59aa1f0f0]
aws_iam_role.eks_cluster_role: Refreshing state... [id=eks_cluster_role]
aws_iam_role_policy_attachment.eks_worker_ecr_policy: Refreshing state... [id=EKSWorkerPolicy-20230823192159482000000003]
aws_iam_instance_profile.eks_worker: Refreshing state... [id=eksworker-profile]
aws_iam_role_policy_attachment.eks_worker_cni_policy: Refreshing state... [id=EKSWorkerPolicy-20230823192159558000000004]
aws_iam_role_policy_attachment.eks_worker_eks_policy: Refreshing state... [id=EKSWorkerPolicy-20230823192159473900000002]
aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=eks_cluster_role-20230823123902890600000002]
aws_subnet.priv_sub_a: Refreshing state... [id=subnet-005488a247071b7d0]
aws_subnet.priv_sub_b: Refreshing state... [id=subnet-0d425ef341c5ef23d]
aws_security_group.eks_security_group: Refreshing state... [id=sg-0f13300686d41f6d8]
aws_security_group_rule.egress_rule: Refreshing state... [id=sgrule-1719358174]
aws_security_group_rule.ingress_rule: Refreshing state... [id=sgrule-1236353175]
aws_eks_cluster.application_cluster: Refreshing state... [id=app_cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_node_group.worker_nodes will be created
  + resource "aws_eks_node_group" "worker_nodes" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "app_cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "m5.large",
        ]
      + node_group_name        = "my-worker-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::140853261613:role/EKSWorkerPolicy"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-005488a247071b7d0",
          + "subnet-0d425ef341c5ef23d",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # aws_iam_policy.eks_worker will be created
  + resource "aws_iam_policy" "eks_worker" {
      + arn         = (known after apply)
      + description = "My policy that grants necessary permissions for EKS Worker Nodes"
      + id          = (known after apply)
      + name        = "eks_worker_role"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeCluster",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.eks_worker_custom_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_worker_custom_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "EKSWorkerPolicy"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kumia01, Action: `pull_request`*